/**
 * 新闻中心详情
 */

var news = {
			// 详情内容
			dataList: [
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 0,
					state: 0,
					time: '2015-07-18',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 1,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 2,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 3,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 4,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 5,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 6,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 7,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				},
				{
					title: '大赢世界，智控未来 | 2018梦派硬科技创新大会取得圆满成功',
					des: '2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不——2018年8月23日下午13点30分，梦派集团以“创新，赋能，共赢”为主题的《2018梦派硬科技创新大会》在登喜路国际大酒店国际厅隆重举行。没有去到现场的朋友不',
					hot: 1,
					id: 8,
					state: 0,
					time: '2018-08-23',
					type: 1,
					url: 'lango19/images/test.jpg'
				}
			],
			
			// 页面初始化
			pageInit: function() {
				try {
					var len = this.dataList.length;
					
					for (var i=0; i<len; i++) {
					  $('#news_img_' + i).attr('src', this.dataList[i]['url']).attr('alt', this.dataList[i]['title'])
						                   .parent('.news-imgbox').attr('href', $('#news_img_' + i).parent('.news-imgbox').attr('href') + this.dataList[i]['id']);
						$('#news_title_' + i).html(this.dataList[i]['title']);
						$('#news_des_' + i).html(this.dataList[i]['des']);
					}
				} catch(e) {
					console.log(e);
				}
			}
		};

/********************************************* 以上声明，以下调用 *********************************************/

$(function(){
	news.pageInit();
	
});
